espressif/arduino-esp32/cores/esp32/HWCDC.cpp
      // Clear interrupt so we won't be called again until this transfer finishes.
      usb_serial_jtag_ll_clr_intsts_mask(USB_SERIAL_JTAG_INTR_SERIAL_IN_EMPTY);

      // Hold hw_cdc_tx_mux across the entire stash read/write region so that a
      // task-side hw_cdc_clear_tx_stash() (from flushTXBuffer(NULL,...) or
      // setTxBufferSize()) cannot interleave with us deciding to drain the
      // stash, writing to the FIFO, and writing back the new tx_stash_len.
      // The lock is per-core re-entrant, so the nested calls in
      // hw_cdc_enable_tx_intr_from_isr() / hw_cdc_disable_tx_intr_from_isr()
      // are safe.
      portENTER_CRITICAL_ISR(&hw_cdc_tx_mux);

      if (tx_stash_len) {
        queued_buff = tx_stash_buf;
        queued_size = tx_stash_len;
        from_stash = true;
      } else {
        queued_buff = (uint8_t *)xRingbufferReceiveUpToFromISR(tx_ring_buf, &queued_size, 64);
      }

      if (queued_buff != NULL && queued_size > 0) {
        sent_size = usb_serial_jtag_ll_write_txfifo(queued_buff, queued_size);
        usb_serial_jtag_ll_txfifo_flush();
        wrote_anything = true;

        if (sent_size < queued_size) {
          tx_stash_len = queued_size - sent_size;
          memmove(tx_stash_buf, queued_buff + sent_size, tx_stash_len);
        } else {
          tx_stash_len = 0;
        }
        if (!from_stash) {
          vRingbufferReturnItemFromISR(tx_ring_buf, queued_buff, &xTaskWoken);
        }
        // Always re-arm IN_EMPTY so that the next host pickup brings us back to
        // drain whatever remains (stash + ring). Don't gate on `connected`: the
        // SOF-watchdog can lag the real state and we'd rather get one spurious
        // ISR than permanently lose the wakeup.
        hw_cdc_enable_tx_intr_from_isr();
      } else {
        // A full 64-byte packet needs an extra flush to send the terminating zero-length packet.
        usb_serial_jtag_ll_txfifo_flush();
        hw_cdc_disable_tx_intr_from_isr();

        // Re-check the ring AFTER disabling the interrupt. If a producer
        // queued data between our ReceiveUpToFromISR() above and the disable,
        // its hw_cdc_enable_tx_intr() may have raced with our disable and got
        // overwritten. Re-arming here under the same spinlock guarantees we
        // don't lose that wakeup. tx_stash_len is also re-checked because the
        // task could have cleared it (e.g. via flushTXBuffer(NULL,...)) right
        // before we took the lock, while a previous ISR pass had left
        // residual data we no longer need to chase.
        UBaseType_t bytes_waiting = 0;
        vRingbufferGetInfo(tx_ring_buf, NULL, NULL, NULL, NULL, &bytes_waiting);
        if (bytes_waiting || tx_stash_len) {
          hw_cdc_enable_tx_intr_from_isr();
        }
      }

      portEXIT_CRITICAL_ISR(&hw_cdc_tx_mux);

      if (wrote_anything) {
        event.tx.len = sent_size;
        arduino_hw_cdc_event_post(ARDUINO_HW_CDC_EVENTS, ARDUINO_HW_CDC_TX_EVENT, &event, sizeof(arduino_hw_cdc_event_data_t), &xTaskWoken);
      }
    } else {
      usb_serial_jtag_ll_clr_intsts_mask(USB_SERIAL_JTAG_INTR_SERIAL_IN_EMPTY);
    }
  }

  if (usbjtag_intr_status & USB_SERIAL_JTAG_INTR_SERIAL_OUT_RECV_PKT) {
    // read rx buffer(max length is 64), and send available data to ringbuffer.
    // Ensure the rx buffer size is larger than RX_MAX_SIZE.
    usb_serial_jtag_ll_clr_intsts_mask(USB_SERIAL_JTAG_INTR_SERIAL_OUT_RECV_PKT);
    uint32_t rx_fifo_len = usb_serial_jtag_ll_read_rxfifo(rx_data_buf, 64);
    uint32_t i = 0;
    for (i = 0; i < rx_fifo_len; i++) {
      if (rx_queue == NULL || !xQueueSendFromISR(rx_queue, rx_data_buf + i, &xTaskWoken)) {
        break;
      }
    }
    event.rx.len = i;
    arduino_hw_cdc_event_post(ARDUINO_HW_CDC_EVENTS, ARDUINO_HW_CDC_RX_EVENT, &event, sizeof(arduino_hw_cdc_event_data_t), &xTaskWoken);
    connected = true;
  }

  if (usbjtag_intr_status & USB_SERIAL_JTAG_INTR_BUS_RESET) {
    usb_serial_jtag_ll_clr_intsts_mask(USB_SERIAL_JTAG_INTR_BUS_RESET);
    arduino_hw_cdc_event_post(ARDUINO_HW_CDC_EVENTS, ARDUINO_HW_CDC_BUS_RESET_EVENT, &event, sizeof(arduino_hw_cdc_event_data_t), &xTaskWoken);
    portENTER_CRITICAL_ISR(&hw_cdc_tx_mux);
    tx_stash_len = 0;
    portEXIT_CRITICAL_ISR(&hw_cdc_tx_mux);
    connected = false;
  }

  // SOF ISR is causing esptool to be unable to upload firmware to the board
  // if (usbjtag_intr_status & USB_SERIAL_JTAG_INTR_SOF) {
  //   usb_serial_jtag_ll_clr_intsts_mask(USB_SERIAL_JTAG_INTR_SOF);
  //   lastSOF_ms = millis();
  // }

  if (xTaskWoken == pdTRUE) {
    portYIELD_FROM_ISR();
  }
}

// Moved to header file as inline function. Kept just as future reference.
//inline bool HWCDC::isPlugged(void) {
// SOF ISR is causing esptool to be unable to upload firmware to the board
// Timer test for SOF seems to work when uploading firmware
//  return usb_serial_jtag_is_connected();//(lastSOF_ms + SOF_TIMEOUT) >= millis();
//}
bool HWCDC::isCDC_Connected() {
  // USB may be unplugged. Do NOT touch tx_stash_len here: a single transient
  // !isPlugged() reading (the SOF watchdog has a few-ms tolerance and is
  // known to flap even on a healthy link) would otherwise silently drop bytes
  // we already pulled out of the ring buffer into the stash.
  if (!isPlugged()) {
    connected = false;
    return false;
  }

  if (connected) {
    return true;
  }

  // Not yet (re)connected. Make sure the IN_EMPTY interrupt is armed and that
  // there is something for the host to clock out so the next IN token will
  // generate the interrupt that flips us back to connected = true. We arm on
  // every call (not just once) so that a stalled int_ena -- whether from a
  // producer/ISR race or from the ISR's empty-branch disable -- always gets
  // re-enabled, breaking what would otherwise be a permanent TX deadlock.
  hw_cdc_enable_tx_intr();
  usb_serial_jtag_ll_txfifo_flush();
  return false;
}

static void flushTXBuffer(const uint8_t *buffer, size_t size) {
  if (!tx_ring_buf) {
    return;
  }
  UBaseType_t uxItemsWaiting = 0;
  vRingbufferGetInfo(tx_ring_buf, NULL, NULL, NULL, NULL, &uxItemsWaiting);
  size_t freeSpace = xRingbufferGetCurFreeSize(tx_ring_buf);
  size_t ringbufferLength = freeSpace + uxItemsWaiting;

